PARCEL_STATUS_CHOICES = (
    (0, 'Создана'),
    (1, 'Ожидает приёмки'),
    (2, 'В доставке'),
    (3, 'Доставлена'),
    (4, 'Выдана'),
    (5, 'Просрочена'),
    (6, 'Забрана на возврат'),
    (7, 'На хранении'),
    (8, 'На возврате'),
    (9, 'Возвращена'),
    (10, 'Проблемная'),
    (11, 'Техническая проблема'),
    (12, 'Отменена'),
    (13, 'Хранение продлено клиентом'))

PARCEL_STATUS_CHOICES_MODIFIED = (
    (0, 'Создана'),
    (1, 'Ожидает приёмки'),
    (2, 'В доставке'),
    (3, 'Закладка'),
    (4, 'Выдана'),
    (5, 'Просрочена'),
    (6, 'Выемка'),
    (7, 'На хранении'),
    (8, 'На возврате'),
    (9, 'Возвращена'),
    (10, 'Проблемная'),
    (11, 'Техническая проблема'),
    (12, 'Отменена'),
    (13, 'Хранение продлено клиентом'))

OTYPE_MAP = {
    "В доставке": "on_delivery",
    "Доставлена": "order_inserted",
    "Выдана": "receive_result",
    "Забрана на возврат": "order_removed"
}
REV_OTYPE_MAP = {
    "on_delivery": "В доставке",
    "order_inserted": "Закладка",
    "receive_result": "Выдана",
    "order_removed": "Выемка"
}